tap "homebrew/cask"
tap "homebrew/cask-fonts"

# bash
brew "bash"
brew "bash-completion@2"

# programming and cli
tap "universal-ctags/universal-ctags/universal-ctags"
brew "cmake"
brew "coreutils"
brew "findutils"
brew "git"
brew "hadolint"
brew "htop"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python3"
brew "reattach-to-user-namespace"
brew "starship"
brew "tmux"

# files and editor
brew "bat"
brew "espanso"
brew "exa"
brew "fd"
brew "fzf"
brew "muesli/homebrew-tap/duf"
brew "neovim"
brew "procs"
brew "rename"
brew "ripgrep"
brew "shellcheck"
brew "thefuck"

# fonts
brew "font-fira-code"

# docker
brew "docker-compose"

# mac apps
tap "federico-terzi/espanso"
cask "alfred"
cask "bartender"
cask "docker"
cask "flux"
cask "iterm2"
cask "keycastr"
cask "omnifocus"
cask "slack"
cask "vlc"
