tap 'homebrew/cask'

# bash
brew 'bash'
brew 'bash-completion@2'

# base utils
brew 'cmake'
brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'python3'
brew 'reattach-to-user-namespace'
brew 'tmux'

# files and editor
brew 'bat'
brew 'fzf'
brew 'neovim'
brew 'rename'
brew 'ripgrep'
brew 'thefuck'
brew 'tree'

# mac apps
# cask 'alfred'
# cask 'bartender'
# cask 'docker'
# cask 'flux'
# cask 'google-chrome'
# cask 'iterm2'
# cask 'keycastr'
# cask 'mindnode'
# cask 'omnifocus'
# cask 'slack'
# cask 'the-unarchiver'
# cask 'vlc'
